IDEA Open Model
ProductionType Enumeration
Compatible with IDEA StatiCa 20.1
 Production type
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum ProductionType
Public Enumeration ProductionType
Members
Member name | Value | Description
HotRolledAndProcessed | 0 |  Hot rolled and processed
Patented | 1 |  Patented
ColdDrawn | 2 |  Cold drawn
StressRelieved | 3 |  Stress relieved
LowRelaxation | 4 |  Low relaxation
See Also
Reference
IdeaRS.OpenModel.Material Namespace